{"id": "seed_1", "description": "Készíts 2–3 helyesírási hibát a mondatban: ékezetek elhagyása, betűcserék, betűkihagyások. A szavak többsége maradjon változatlan, a mondat jelentése nagyjából ugyanaz maradjon.", "parent_id": null, "evol_type": "seed", "eval_pass_rate": 0.75, "n_eval": 4}
{"id": "seed_2", "description": "Ronts el néhány nyelvtani egyeztetést: szám, személy, eset vagy igeidő szintjén. Legyen 2–4 nyelvtani hiba, de a mondat szerkezete nagyrészt maradjon az eredetihez hasonló.", "parent_id": null, "evol_type": "seed", "eval_pass_rate": 0.75, "n_eval": 4}
{"id": "seed_3", "description": "Keverj a mondatba rag- és névutó-hibákat: például -ban/-ben, -tól/-től, -hoz/-hez/-höz, illetve névutók (mellett, ellen, felé) téves használata. Legyen 2–3 ilyen hiba.", "parent_id": null, "evol_type": "seed", "eval_pass_rate": 1.0, "n_eval": 4}
{"id": "seed_4", "description": "Változtasd meg a mondat szórendjét úgy, hogy magyar anyanyelvű számára természetellenes, pongyola legyen, de még érthető maradjon. Legyen 1–2 szórendi hiba, esetleg 1 helyesírási hiba.", "parent_id": null, "evol_type": "seed", "eval_pass_rate": 1.0, "n_eval": 4}
{"id": "seed_5", "description": "Hagyj ki vagy tegyél be vesszőket rossz helyre, és keverj bele 1–2 kisebb helyesírási hibát is. Írásjelekre és kötőszavakra fókuszálj.", "parent_id": null, "evol_type": "seed", "eval_pass_rate": 0.25, "n_eval": 4}
{"id": "depth_6", "description": "A feladatod két, magyar helyesírás hibákat tartalmazó mondat létrehozása a megadott hibacsaládba tartozó elvek mentén, miközben a mondat értelmezhetősége megmarad. Hiba típusai: ékezetek hiánya (pl. \"haza\" helyett \"haza\"), betűcserék (pl. \"kert\" helyett \"ketre\"), betűkihagyások (pl. \"fogorvos\" helyett \"fogorvos\"). A szavak legalább 70%-ának változatlanul kell maradnia, a hibák ne legyenek nyilvánvalóak vagy értelmetlenségek (pl. \"szék\" helyett \"szék\"). Minden hibatípushoz legalább egy konkrét példát kell adnod a mondatban.", "parent_id": "seed_1", "evol_type": "in_depth", "eval_pass_rate": 1.0, "n_eval": 3}
{"id": "depth_7", "description": "Szám- és személyegyeztetési hibák generálása: Hozz létre mondatokat, ahol a névszói és igei alanyok között szám- és személyegyeztetési hiba található. Például: \"A diákok ma tanulniak.\" (helyesen: \"tanulnak\") vagy \"Az autó pirosak.\" (helyesen: \"piros\"). Generálj 6-7 ilyen hibát mondatonként, de tartsd meg az eredeti mondat szerkezetét. A hibák legyenek szándékosan figyelemre méltóak, de ne legyenek teljesen értelmetlenek.", "parent_id": "seed_2", "evol_type": "in_depth", "eval_pass_rate": 0.3333333333333333, "n_eval": 3}
{"id": "depth_8", "description": "A feladatod az, hogy magyar mondatokba szándékosan illeszd be helytelen rag- és névutókat. Különös figyelmet fordíts a következő hibatípusokra: -ban/-ben, -tól/-től, -hoz/-hez/-höz ragok helytelen használata (pl. \"a házban\" helyett \"a házban\", \"az asztaltól\" helyett \"az asztaltól\"), valamint a mellett, ellen, felé névutók téves alkalmazása (pl. \"az iskolánál\" helyett \"az iskolánál\"). Generálj 6-7 ilyen hibát mondatonként, és a hibás részeket jelöld szögletes zárójelekkel, pl.: [az iskolánál]. Győződj meg róla, hogy a hibák nyilvánvalóak, de mégis természetesen hangzanak a mondat kontextusában.", "parent_id": "seed_3", "evol_type": "in_depth", "eval_pass_rate": 0.6666666666666666, "n_eval": 3}
{"id": "depth_9", "description": "A feladatod az, hogy magyar mondatokat alakíts át úgy, hogy azok szórendje természetellenes és pongyola legyen, mégis érthető maradjon. Készíts 1-2 szórendi hibát, és esetleg 1 helyesírási hibát minden mondatban. A szórendi hibák lehetnek például: - Tárgy helyett alanyi szórend (helyett: \"Az könyvet olvasom\" → helyes: \"Könyvet olvasok\") - Birtokos szerkezetek felcserélése (helyett: \"Az Péter autója\" → helyes: \"Péter autója\") - Melléknév és főnév rossz sorrendje (helyett: \"Ez egy szép ház\" → helyes: \"Ez egy ház szép\") A helyesírási hiba lehet például: - Hiányzó vagy felesleges ékezet (pl. \"alma\" → \"almá\", \"kert\" → \"kért\") - Rossz betűk használata (pl. \"leves\" → \"lewes\", \"név\" → \"nef\") A hibákat úgy alakítsd ki, hogy a mondat még érthető maradjon, de egy magyar anyanyelvű azonnal észrevesse a hibákat.", "parent_id": "seed_4", "evol_type": "in_depth", "eval_pass_rate": 0.6666666666666666, "n_eval": 3}
{"id": "depth_10", "description": "A feladatod az, hogy magyar szövegeken végezz hibajavítást, amelyek főként az írásjelek (kommák, pontok, kérdőjelek, felkiáltójelek) és kötőszavak (és, de, vagy, hanem, hiszen, mert stb.) használatában tartalmaznak hibákat. A szövegekben találj legalább egy olyan hibát, ahol hiányzik egy kötelező vessző, vagy feleslegesen van beiktatva egy. Ezen kível keress legalább egy helyesírási hibát is, amely lehet például elgépelt szó, rossz toldalékozás, vagy nem megfelelő i/í, j/ly használata. Példa hibás szövegrész: \"Az iskola után siettem haza mert féltem hogy elkésnek a buszok.\" Itt hiányzik a \"mert\" előtti vessző, valamint a \"hogy\" után is kellene vessző. A \"féltem\" szó után is kötőjelet kellene tenni helyesen.", "parent_id": "seed_5", "evol_type": "in_depth", "eval_pass_rate": 0.6666666666666666, "n_eval": 3}
{"id": "breadth_11", "description": "Gépelj be a mondatba 6-7 olyan hibásan írt idegen szót, amely magyarul elterjedten használatos, de gyakosan elíródnak (pl. \"konzepció\", \"etikett\", \"kompjúter\", \"menedzser\"). A szavak legyenek azonosíthatóan rosszul leírva, de a mondat értelmezhető maradjon.", "parent_id": "pool", "evol_type": "in_breadth", "eval_pass_rate": 0.6666666666666666, "n_eval": 3}
{"id": "depth_12", "description": "A feladatod az, hogy a megadott mondatban helyesírási hibákat ejts, úgy hogy a szöveg eredeti jelentése megmaradjon. Készíts ékezetelési hibákat (pl. \"lát\" helyett \"lat\"), betűcseréket (pl. \"kert\" helyett \"kret\") és betűkihagyásokat (pl. \"ház\" helyett \"hz\"). A szavak maximum 30%-a változzon, de a mondat összefüggő és érthető maradjon. Példa: eredeti mondat: \"Az erdőben sétálva láttam egy szép kertet.\" hibás verzió: \"Az erdöben szetálva lattam egy szép kretet.\"", "parent_id": "seed_1", "evol_type": "in_depth", "eval_pass_rate": 0.6666666666666666, "n_eval": 3}
{"id": "depth_13", "description": "A feladatod az, hogy a mondatokban szándékosan hibákat ejts a magyar nyelvtani egyeztetési szabályok megsértésével. Konkrétan a következő hibákat kell elkövetned:", "parent_id": "seed_2", "evol_type": "in_depth", "eval_pass_rate": 0.3333333333333333, "n_eval": 3}
{"id": "depth_14", "description": "A feladatod, hogy magyar mondatokba szándékosan illeszd be a helytelen rag- és névutó-használatokat. Fókuszálj különösen a következő párokra: \"-ban/-ben\" (pl. \"Az ünnepséget **ban** tartották\" helyett \"Az ünnepséget **ben** tartották\"), \"-tól/-től\" (pl. \"Az férfitól jött a hír\" helyett \"Az férfitől jött a hír\") és \"-hoz/-hez/-höz\" (pl. \"Az iskolához ment\" helyett \"Az iskolához ment\"). Illeszd be továbbá a melletti, elleni, feléi névutók hibás használatát (pl. \"Az épület mellett állt\" helyett \"Az épület mellett állt\"). A mondatokban ha lehetséges szerepeljen 6-7 ilyen típusú hiba, és a mondatoknak értelmüket vesztik vagy érthetetlenné válnak a hibák miatt.", "parent_id": "seed_3", "evol_type": "in_depth", "eval_pass_rate": 1.0, "n_eval": 3}
{"id": "depth_16", "description": "A feladatod, hogy a megadott szövegekben szándékosan hozz létre hibákat a magyar nyelv szabályai szerint. Különös figyelmet fordíts a vesszők használatára: hagyj ki szükséges vesszőket, vagy helyettük tegyél olyat, ahol nem kellene. Például: \"Azonban a tanulok fáradtak voltak így nem tudtak koncentrálni\" (hiányzó vessző kötőszó előtt) vagy \"A tanulók fáradtak voltak, így, nem tudtak koncentrálni\" (felesleges vessző). Emellett tegyél bele 1-2 kisebb helyesírási hibát is, mint például \"kávé\" helyett \"kavi\" vagy \"ház\" helyett \"hass\". Fókuszálj az írásjelek különféle típusaira (pont, kérdőjel, felkiáltójel, kettőspont, pontosvessző) és a kötőszavakra (mert, hogy, azonban, emiatt, ezért, tehát stb.).", "parent_id": "seed_5", "evol_type": "in_depth", "eval_pass_rate": 0.6666666666666666, "n_eval": 3}
{"id": "breadth_17", "description": "Módosíts még legalább két ikes ige ragozását a mondatban. Cserélj fel -om/-om, -ol/-ol, -unk/-unk, -otok/-otok, -nak/-nek ragokat, vagy írj hibásan többes számú 1. személyű -unk/-ük végződést. Az ige jelentése maradjon változatlan, de a ragozás legyen nyilvánvalóan hibás.", "parent_id": "pool", "evol_type": "in_breadth", "eval_pass_rate": 0.6666666666666666, "n_eval": 3}
{"id": "depth_18", "description": "A feladatod, hogy a megadott mondatban 6-7 hibát ejts, melyek kizárólag a következő kategóriákba tartoznak: ékezetek elhagyása (pl. \"alma\" → \"alma\", \"körte\" → \"körte\"), betűcserék (pl. \"hal\" → \"lah\" vagy \"kislány\" → \"kisnály\") és betűkihagyások (pl. \"szék\" → \"szék\", \"könyv\" → \"könyv\"). Fontos, hogy a szavak legalább 70%-a változatlan maradjon, és a mondat általános értelme megmaradjon. Példa: Az \"árvíztűrő tükörfúrógép\" mondatból érvényes hibák lehetnek: \"árvíztűro tükörfúrogép\" (ékezetek elhagyása), \"árvíztrűrő tükörfúrógép\" (betűcserék) vagy \"árvíztűrő tükörfúrógép\" (betűkihagyás).", "parent_id": "seed_1", "evol_type": "in_depth", "eval_pass_rate": 0.6666666666666666, "n_eval": 3}
{"id": "depth_19", "description": "A feladatod az, hogy egy magyar mondatban szándékosan hozz létre 6-7 nyelvtani egyeztetési hibát, amelyek a szám, személy, eset vagy igeidő kategorákba esnek. A hibák legyenek következetesek és ne változtassák meg alapvetően a mondat szerkezetét. Például: \"A gyerekek (többes szám) fut (egyes szám 3. személy) a parkban.\" vagy \"Márton meghívta (tárgyeset) az barátait (birtokos eset).\" A cél, hogy a hibák nyilvánvalóak legyenek, de a mondat még érthető maradjon.", "parent_id": "seed_2", "evol_type": "in_depth", "eval_pass_rate": 0.6666666666666666, "n_eval": 3}
{"id": "depth_21", "description": "A feladatod, hogy módosítsd a megadott mondatok szórendjét úgy, hogy azok természetellenes, pongyola vagy stilisztikailag nem megfelelő legyenek, miközben azok még érthetőek maradnak. Ezt úgy kell elérned, hogy minden egyes mondatban pontosan egy szórendi hibát ejtesz, amely a magyar nyelv alapvető szórendi szabályait sérti (pl. ige helytelen pozícióba helyezése, melléknév helytelenül kerül a főnév elé, vagy kötőszó felesleges/nem megfelelő használata). Emellett minden mondatban tartalmazzon egy kifejezetten szándékos helyesírási hibát is, amely a magyar helyesírás gyakori hibáinak egyike (pl. i/í, j/ly, o/ó, ö/ő, u/ú, ü/ű, s/ss, z/zz, c/cs, dz/dzs, gy/g, ty/t). Például: \"A gyerekek boldogan játszanak az udvaron\" helyett: \"A gyerekek játszanak boldogan az udvaron\" és \"A gyerek boldogan jatszik az udvaron\".", "parent_id": "seed_4", "evol_type": "in_depth", "eval_pass_rate": 1.0, "n_eval": 3}
{"id": "depth_22", "description": "Hozz létre szöveget, amelyben szándékosan hibásan használsz vesszőket, betűveket és írásjeleket. Konkrétan: hagyj ki legalább 3 szükséges vesszőt, tegyél be legalább 2 felesleges vesszőt, cserélj fel 2–3 betűt a szavakban (pl. 'kert' helyett 'kret'), és írj helytelenül 1–2 kötőszót (pl. 'hogy' helyett 'hozzá'). Például: 'A kretben sétáltam amikor észrevettem egy szépi virágot de nem szedtem le mert nem volt kedvem.'\"", "parent_id": "seed_5", "evol_type": "in_depth", "eval_pass_rate": 0.6666666666666666, "n_eval": 3}
{"id": "breadth_23", "description": "Készíts 1-2 ikés ige-használati hibát a mondatban, például a \"-ik\" képző ismeretlenül használata (\"mosik\" helyett \"mos\" vagy \"mossa\"), vagy a \"-ik\" nélküli ragozás (\"mászol\" helyett \"maszik\"). A mondat többi része változatlan maradjon, de a mondat értelmes maradjon, és csak az ikés ige szabálytalan használatára figyelj.", "parent_id": "pool", "evol_type": "in_breadth", "eval_pass_rate": 0.3333333333333333, "n_eval": 3}
{"id": "depth_24", "description": "A hibatípusok: ékezetek elhagyása, betűcserék és betűkihagyások. A feladatod az, hogy a megadott mondatban pontosan 6-7 ilyen hibát ejts. Az ékezetek elhagyásánál figyelj arra, hogy csak az ékezettelen változat létező magyar szót jelentsen (pl. \"alma\" helyett \"almá\"). A betűcserék esetében csak olyan cseréket végezz, amelyek után is létező szó keletkezik (pl. \"kert\" helyett \"kret\"). A betűkihagyásnál pedig úgy távolíts el betűket, hogy a szó továbbra is érthető maradjon (pl. \"szó\" helyett \"só\"). A mondat szerkezete és jelentése nagyjából változatlan maradjon, a szavak 80%-a pedig pontosan ugyanaz legyen, mint az eredetiben.", "parent_id": "seed_1", "evol_type": "in_depth", "eval_pass_rate": 1.0, "n_eval": 3}
{"id": "depth_25", "description": "Szám- és személybeli egyeztetési hibák generálása: Készíts mondatokat, amelyekben szándékosan megsérted a magyar nyelvben a szám és személy szerinti egyeztetés szabályait. Például: \"A diákok ma le vannak foglalva, hogy a tanárunk holnap kiosztja a házi feladatokat\" (hereben a \"kiosztja\" helyett \"kiosztják\" lenne a helyes, hiszen a \"diákok\" többes szám). Hozz létre 6-7 ilyen hibát egy mondatban, de a mondat szerkezete maradjon változatlan. Másik példa: \"Azok a gyerekek, akik jól dolgoznak, kapnak egy kis ajándékot\" (itt a \"kapnak\" helyett \"kap\" lenne hibás, mert a \"gyerekek\" többes számú alany egyeztetése szerint többes számbú ige szükséges).", "parent_id": "seed_2", "evol_type": "in_depth", "eval_pass_rate": 0.3333333333333333, "n_eval": 3}
{"id": "depth_26", "description": "A feladatod egy magyar mondat létrehozása, amelyben legalább két, de legfeljebb három helytelen használatú rag- vagy névutó található. Különös figyelmet fordíts a következő hibatípusokra: a hely/beli ragok (-ban/-ben, -n/-en/-ön) téves alkalmazása, az irányt jelző ragok (-hoz/-hez/-höz, -ba/-be, -ból/-ből) helytelen használata, valamint az elszeparált névutók (mellett, felett, alatt, felé, ellen) hibás beillesztése. Például a \"Az ünnepség mellett a parkba mentünk\" mondatban a mellett helyett a mellett kellene használni, mivel ez egy elszeparált névutó. Generálj egy olyan mondatot, ahol a helyes és hibás formák között különbség van, és a hibák nyilvánvalóak legyenek a helyes nyelvhasználat ismerője számára.", "parent_id": "seed_3", "evol_type": "in_depth", "eval_pass_rate": 0.6666666666666666, "n_eval": 3}
{"id": "depth_27", "description": "A feladatod egy magyar mondat szórendjének szándékos megváltoztatása, hogy az anyanyelvű beszélők számára természetellenes, mégis érthető maradjon. Generálj 1-2 szórendi hibát, lehetőség szerint egy helyesírási hibával kiegészítve. A szórendi hibák közül egy lehet az alany-ige-tárgy szerkezet felborítása, például: \"A kutya megharapta a postást\" helyett \"A kutya a postást megharapta\". Másik típus lehet a jelzői szerkezet helytelen elrendezése, például: \"A piros autó elhajtott\" helyett \"Az autó piros elhajtott\". A helyesírási hiba lehet például egy i/í vagy j/gy használatának felcserélése, mint \"eljött\" helyett \"eljöt\". A hibáknak olyan mértékűnek kell lenniük, hogy nyilvánvalóan hibásak legyenek, de ne legyenek annyira súlyosak, hogy a mondat teljesen érthetetlenné váljon.", "parent_id": "seed_4", "evol_type": "in_depth", "eval_pass_rate": 1.0, "n_eval": 3}
{"id": "depth_28", "description": "A feladatod, hogy szándékosan hibás szöveget generálj a magyar nyelv szabályai szerint. A hibák főként a vesszőhasználat, írásjelek és kötőszavak terén legyenek, de tartalmazzon 1-2 kisebb helyesírási hibát is. Konkrétan:", "parent_id": "seed_5", "evol_type": "in_depth", "eval_pass_rate": 0.6666666666666666, "n_eval": 3}
{"id": "breadth_29", "description": "Módosítsd meg a mondatban az ikes igéket: cseréld le a helyes képzésmódosító toldókat téves alakra (pl. \"megyek\" helyett \"megyek\", \"veszem\" helyett \"veszem\"). Legyen 6-7 ilyen típusú hiba, de a mondat tartalma és alapvető szerkezete maradjon változatlan.", "parent_id": "pool", "evol_type": "in_breadth", "eval_pass_rate": 0.3333333333333333, "n_eval": 3}
{"id": "depth_30", "description": "Készíts 2–3 helyesírási hibát a mondatban, amelyek kifejezetten ékezetelési hibákat jelentenek: ékezetek elhagyása, rossz ékezet használata (pl. á helyett ő), vagy az ékezet nélküli és ékezetes betűk felcserélése. A hibákat olyan gyakori szavakban ejtsd el, amelyekben jelentősége van az ékezeteknek (pl. \"álom\" helyett \"alom\", \"kész\" helyett \"kesz\"). A mondat szerkezete és alapvető jelentése megmaradjon, csak az ékezetekkel kapcsolatos hibákat ejtsd el.", "parent_id": "seed_1", "evol_type": "in_depth", "eval_pass_rate": 0.6666666666666666, "n_eval": 3}
{"id": "depth_31", "description": "\"Fejleszd tovább a feladatot úgy, hogy a nyelvtani egyeztetési hibák középpontjában a szám- és személybeli egyeztetés álljon. Készíts mondatokat, amelyekben a főnév és a jelzője (pl. szín, mennyiség) nem egyezik szám szerint, vagy az ige és az alany nem egyezik személy vagy szám szerint. Például: 'A három kislány játszik a kertben' helyett 'A három kislány játszanak a kertben', vagy 'Azok a szép virágok nyílnak' helyett 'Azok a szép virág nyílik'. A mondatok szerkezete maradjon változatlan, csak az egyeztetési hibák legyenek jelen 6-7 darabban minden mondatban.\"", "parent_id": "seed_2", "evol_type": "in_depth", "eval_pass_rate": 0.6666666666666666, "n_eval": 3}
{"id": "depth_32", "description": "Generálj mondatokat, amelyekben a magyar nyelvű helyhatározó ragok és névutók hibásan vannak használatban. A hibák legyenek szándékosak, de hitelesek. Fókuszálj különösen a következő párokra: -ban/-ben (pl. \"az házban\" helyett \"az házban\"), -tól/-től (pl. \"az iskolától\" helyett \"az iskolától\"), -hoz/-hez/-höz (pl. \"az iskolához\" helyett \"az iskolához\"). További gyakori hibák: a mellett/alatt/ellen/felé/iránya névutók téves ragozása (pl. \"az épület mellett\" helyett \"az épület mellett\"). A mondatokban ha lehetséges szerepeljen 6-7 ilyen hiba, és a hibák legyenek összefüggőek, ne csak önkényesek.", "parent_id": "seed_3", "evol_type": "in_depth", "eval_pass_rate": 0.6666666666666666, "n_eval": 3}
{"id": "depth_33", "description": "A feladatod, hogy egy magyar mondat természetellenes, de még érthető szórendet kapjon. Módosítsd a mondat szerkezetét úgy, hogy:", "parent_id": "seed_4", "evol_type": "in_depth", "eval_pass_rate": 1.0, "n_eval": 3}
{"id": "depth_34", "description": "A feladatod az, hogy a megadott szövegben szándékosan hibákat ejts. A fő hibatípusok a helytelen vesszőhasználat és a kisebb helyesírási hibák. A vesszőkkel kapcsolatban végezd el a következőket: hagyj ki kötelezően szükséges vesszőt az aláhúzott részek előtt (pl. mellékmondat, felsorolás, appozíció esetén), vagy éppen adj oda felesleges vesszőt, ahol nem lenne szabad (pl. egyszerű mondatrészek között, főmondatban). Két konkrét példa: \"Az étteremben étkezünk ahol a szolgáltatás kiváló\" (hiányzó vessző mellékmondat előtt) vagy \"A tanuló, alaposan felkészült, a vizsgán.\" (felesleges vessző főmondat végén). Helyesírási hibákból generálj 1-2 kisebb hibát, amelyek nem változtatják meg jelentősen a szöveg értelmét, de nyilvánvalóan hibásak (pl. \"kocsival\" helyett \"kocsival\", \"azt\" helyett \"az\"). A kötőszavak és írásjelek használata is legyen pontatlan (pl. \"hogy\" helyett \"hogy\", \"viszont\" helyett \"viszont\", hiányzó vagy felesleges gondolatjel).", "parent_id": "seed_5", "evol_type": "in_depth", "eval_pass_rate": 0.0, "n_eval": 3}
{"id": "breadth_35", "description": "Írj át egy mondatot úgy, hogy az ikes igéknél tévesen használj a/é ragot! Legyen 6-7 ilyen hiba, például \"megyek\" helyett \"megyek\", \"eszünk\" helyett \"eszünk\". A mondat többi része maradjon változatlan, és a jelentés ne torzuljon.", "parent_id": "pool", "evol_type": "in_breadth", "eval_pass_rate": 0.3333333333333333, "n_eval": 3}
{"id": "depth_36", "description": "Generálj a mondatban 2–3 ékezetelmaradási hibát, amelyek kizárólag a magyar nyelv sajátos ékezetes betűire (á, é, í, ó, ő, ú,ű) vonatkoznak. Az ékezetet elhagyó betű maradjon a helyes helyén, és ne változtass meg a szó többi karakterét. Például a \"pálya\" szóból legyen \"palya\", de ne változtasd meg a \"pályán\" szót \"paljan\"-ra, mert az már a szó jelentését is befolyásolná. A mondat értelmezhetősége megmaradjon, a hibáktól eltekintve a mondat strukturáltsága és szórendje változatlan.", "parent_id": "seed_1", "evol_type": "in_depth", "eval_pass_rate": 0.6666666666666666, "n_eval": 3}
{"id": "depth_37", "description": "Generálj olyan mondatokat, amelyekben szándékosan megsérted a magyar nyelv alanyi egyeztetésének szabályait. Hozz létre 6-7 hibát, amelyek a következők közé tartoznak: - számbeli egyeztetési hiba (pl. egyes számban álló ige többes számban, vagy fordítva) - személybeli egyeztetési hiba (pl. harmadik személyű ige első személyű alannyal) - Az eredeti mondat szerkezete tartsa meg, csak az egyeztetés legyen hibás. Példa: \"A gyerekek játszanak az udvaron\" -> \"A gyerek játszanak az udvaron\" (számbeli hiba) vagy \"A gyerekek játszunk az udvaron\" (személybeli hiba).", "parent_id": "seed_2", "evol_type": "in_depth", "eval_pass_rate": 0.6666666666666666, "n_eval": 3}
{"id": "depth_38", "description": "Generálj mondatokat, amelyekben a helyes ragok és névutók használata téves. Fókuszálj különösen a -ban/-ben, -hoz/-hez/-höz, -tól/-től helyesírására, valamint a mellet, ellen, felé névutók helyes használatára. Például: \"A boltban\" helyett \"A boltban\", \"A könyvhez\" helyett \"A könyvhez\", \"A háztól\" helyett \"A háztól\", \"Az iskol mellett\" helyett \"Az iskol mellett\", \"A város felé\" helyett \"A város felé\". Generálj olyan mondatokat, amelyekben ezek a hibák logikailag nem megfelelő módon jelennek meg, és a mondat értelmezhetetlenné vagy félreérthetővé válik. Minden mondatban legyen 6-7 ilyen típusú hiba.", "parent_id": "seed_3", "evol_type": "in_depth", "eval_pass_rate": 0.6666666666666666, "n_eval": 3}
{"id": "depth_39", "description": "A feladatod, hogy magyar mondatokat alakíts át oly módon, hogy a szórendjük természetellenes, pongyola legyen, mégis érthető maradjon. Hozz létre 1-2 szórendi hibát, például: helytelenül használt névszói állítmányos szerkezet (pl. \"Az a piros virág a kertben van\" helyett \"A piros virág az a kertben van\"), vagy hibás igei állítmányos mondat (pl. \"Péter este sétál a parkban\" helyett \"Este sétál Péter a parkban\"). Ezen kívül szerepeltess 1 helyesírási hibát is, például: hibás toldalékolás (pl. \"Az autóban ülök\" helyett \"Az autóban ülök\"), vagy összetett szóhibás írás (pl. \"konyhafőnök\" helyett \"konyha-főnök\"). A mondatok eredeti jelentése maradjon meg.", "parent_id": "seed_4", "evol_type": "in_depth", "eval_pass_rate": 0.6666666666666666, "n_eval": 3}
{"id": "depth_40", "description": "A feladatod, hogy magyar szövegeken hibákat ejts: szabálytalanul helyezz el vesszőket, hiányogass vagy adj hozzá feleslegeseket, valamint egy-egy kisebb helyesírási hibát ejts. Konkrétan a következőkre figyelj:", "parent_id": "seed_5", "evol_type": "in_depth", "eval_pass_rate": 1.0, "n_eval": 3}
{"id": "breadth_41", "description": "Készíts 6-7 hibát a mondatban az ikes igék helyesírásával kapcsolatban. Generálj hibás alakokat, ahol hiányzik az \"-ik\" végződés (pl. \"mos\" helyett \"mosik\"), vagy feleslegesen hozzáadódik (pl. \"mosik\" helyett \"mos\"). A mondat többi része maradjon változatlan, a jelentés legyen még érthető.", "parent_id": "pool", "evol_type": "in_breadth", "eval_pass_rate": 0.3333333333333333, "n_eval": 3}
{"id": "breadth_42", "description": "Generálj egy magyar mondatot, amelyben legalább 3-4 olyan igei hiba található, ahol az ikes igék (pl. megy, lát, eszik) hibás ragozása jelenik meg. Különös figyelmet fordíts az olyan gyakori hibákra, mint a -ik/-ek/-ok ragok téves használata (pl. \"mehetek\" helyett \"mehenek\"), vagy a múlt idő képzésénél a \"-t\"/-tt\" helyett a \"-k\"/-ék\" ragok alkalmazása (pl. \"mentem\" helyett \"mentek\"). A mondat értelmezhetősége megmaradjon, a hibák azonban nyilvánvalóak legyenek anyanyelvi beszélők számára.", "parent_id": "pool", "evol_type": "in_breadth", "eval_pass_rate": 0.6666666666666666, "n_eval": 3}
{"id": "breadth_43", "description": "A feladatod az, hogy magyar mondatokat írj úgy, hogy a dátumokat és időpontokat hibásan jelöld. Használj helytelen dátumformátumokat (pl. \"2023.12.25.\" helyett \"23.12.25.\"), vagy keverd a napokat és hónapokat (pl. \"január 5.\" helyett \"5. január\"). A számok esetében írj hibásan számjegyeket (pl. \"1000 Ft helyett \"00 Ft\") vagy használj helytelen számolási jeleket (pl. \"5 kg helyett \"5kq\"). A dátumok és számok hibás írása legyen azonosítható, de a mondat értelmezhető maradjon.", "parent_id": "pool", "evol_type": "in_breadth", "eval_pass_rate": 0.6666666666666666, "n_eval": 3}
{"id": "depth_44", "description": "Készíts 2-3 helyesírási hibát a mondatban, amelyek a következő kategóriákba tartoznak: ékezetek elhagyása (pl. \"lát\" → \"lat\"), betűcserék (pl. \"kert\" → \"kret\") és betűkihagyások (pl. \"ház\" → \"hz\"). A szavak legalább 70%-ának változatlanul kell maradnia, a mondat alapvető jelentése megmaradjon. Példa: Az erdőben sétáltunk, amikor megláttuk a szép szarvast → Az erdöben szétáltunk, amikor megláttük a szép szarvast.", "parent_id": "seed_1", "evol_type": "in_depth", "eval_pass_rate": 0.8333333333333334, "n_eval": 6}
{"id": "depth_45", "description": "Generálj mondatokat, amelyekben szándékosan hibásan használt helyesírási szabályok okoznak félreértést, különös tekintettel a ragokra és névutókra. Fókuszálj a következő hibatípusokra: a -ban/-ben, -hoz/-hez/-höz, -tól/-től helyesírásának felcserélésére, valamint a mellet, ellen, felé névutók hibás használatára. Példák: \"Az iskolban\" helyett \"Az iskolban\", \"A barátomhoz\" helyett \"A barátomhoz\", \"A téltől\" helyett \"A téltől\", \"Az üzlet mellett\" helyett \"Az üzlet mellett\", \"A folyó ellen\" helyett \"A folyó ellen\". Minden mondatban legalább 6 ilyen hibát tartalmazz, amelyek logikailag összefüggenek, és a mondat értelmezhetetlenné vagy félreérthetővé válik. A hibákat úgy alakítsd ki, hogy egy valós szövegkontextusban logikusnak tűnjenek, de valójában helytelenek legyenek. Használj különböző nyelvtani szerkezeteket, hogy széles körű hibákat mutass be.", "parent_id": "depth_38", "evol_type": "in_depth", "eval_pass_rate": 0.6666666666666666, "n_eval": 6}
{"id": "depth_46", "description": "A feladatod két magyar helyesírás hibákat tartalmazó mondat létrehozása, amelyek meghatározott hibacsaládba tartoznak, miközben a mondatok értelmezhetősége megmarad. Hiba típusok: ékezethiány (pl. \"kert\" helyett \"kert\"), betűcserék (pl. \"nyelv\" helyett \"nyelv\"), betűkiegészítések (pl. \"fa\" helyett \"fafa\"), betűkihagyások (pl. \"hal\" helyett \"ha\"). A mondatok legalább 70%-ának változatlanul kell maradnia, a hibák ne legyenek nyilvánvalóak vagy értelmetlenségek. Minden hibatípushoz legalább egy egyértelmű példát kell mutatnod a mondatban. A hibákat úgy kell elhelyezned, hogy azok ne legyenek egymás mellett, és ne okozzanak összetévesztést az olvasóban. A mondatoknak természetesnek kell tűnniük, mintha véletlenül történtek volna a hibák.", "parent_id": "depth_6", "evol_type": "in_depth", "eval_pass_rate": 0.6666666666666666, "n_eval": 6}
{"id": "depth_47", "description": "A feladatod az, hogy egy magyar mondatot úgy alakíts át, hogy szórendhibákat tartalmazzon, de még mindig értelmes maradjon. A szórendhibák legyenek olyan termésleteslenek, hogy egy anyanyelvű azonnal észrevehesse őket, de mégsem tegyék érthetetlenné a mondatot. Konkrét példák: - Cseréld fel az alanyt és a tárgyat helyes mondatszerkezetben (pl. \"A kutya megeszi a鸿鸿t\" helyett \"A鸿鸿 eszi meg a kutyát\") - Hozz létre logikai ellentmondásokat a szórenddel (pl. \"Mindenki hazament, kivéve Pétert\" helyett \"Kivéve Pétert, mindenki hazament\") - Használj feleslegesen hosszú szórendet egyszerűbb mondatoknál (pl. \"Éhes vagyok\" helyett \"Éhes vagyok, hogy most este evni szeretnék valamit\") Szabályok: - Legyen pontosan 2 szórendi hiba a mondatban - Ne legyen több mint 1 helyesírási hiba - Az átalakított mondat legyen még mindig érthető, csak termáleteslen", "parent_id": "seed_4", "evol_type": "in_depth", "eval_pass_rate": 0.5, "n_eval": 6}
{"id": "depth_48", "description": "Generálj 2–3 ékezetelési hibát a megadott mondatban, amelyek kifejezetten az alábbi kategóriákba tartoznak: ékezetek teljes elhagyása (pl. \"árvíz\" → \"arviz\"), téves ékezethasználat (pl. \"úr\" → \"úr\" helyett \"űr\", vagy \"késő\" → \"keső\"), valamint ékezetes és ékezet nélküli betűk felcserélése (pl. \"kő\" → \"ko\", \"víz\" → \"vız\"). A hibákat olyan gyakori magyar szavakban ejtsd el, amelyek jelentését élesen változtatja meg az ékezetek hiánya vagy téves használata, például \"álom\" (alom), \"kész\" (kesz), \"tár\" (tár helyett tör), \"szól\" (szol) vagy \"nő\" (no). A mondat eredeti szerkezete és alapvető jelentése maradjon meg, az ékezetelési hibákon kívül más nyelvhelyességi hibát ne ejts.", "parent_id": "depth_30", "evol_type": "in_depth", "eval_pass_rate": 0.8333333333333334, "n_eval": 6}
{"id": "breadth_49", "description": "Generálj magyar mondatokat, ahol szándékosan hibásan használt idegen kifejezések vagy szókapcsolatok szerepelnek. Például angol kifejezések helyettesítése magyar megfelelőikkel, vagy olyan angol szavak használata, amelyeknek van magyar megfelelőjük (pl. \"meeting\" helyett \"találkozó\", \"download\" helyett \"letöltés\"). A mondatban legyen legalább 2 ilyen hibás ideigen kifejezés, de a mondat még érthető maradjon.", "parent_id": "pool", "evol_type": "in_breadth", "eval_pass_rate": 0.6666666666666666, "n_eval": 6}
{"id": "depth_50", "description": "A feladatod az, hogy magyar szövegeken végezz alapvető nyelvhelyességi hibajavítást, fókuszálva az írásjelek és kötőszavak helyes használatára. A szövegekben legalább egy kötelező vesszőhiányosságot és egy felesleges vesszőt kell találnod. Az írásjelek hibáin túl, keress legalább két típusú helyesírási hibát: egy elgépelt szót, valamint egy toldalékozási vagy i/í, j/ly használatbeli hibát. Példa hibás szöveg: \"Pénteken este sétáltam a parkban,a barátommal mert beszéltünk az iskolai dolgokról, és nagyon jókat nevetettünk.\" Itt a \"parkban,\" után felesleges a vessző, a \"mert\" előtt hiányzik a kötelező vessző, és a \"jókat\" helyett \"jókat\" kellene írni. A \"barátommal\" szó helyesen a barátommal írandó.", "parent_id": "depth_10", "evol_type": "in_depth", "eval_pass_rate": 0.6666666666666666, "n_eval": 6}
{"id": "depth_51", "description": "A hibatípusok: ékezetelhagyás, betűcserék és betűkihagyások. A feladatod az, hogy a megadott mondatban pontosan 6-7 hibát ejts, amelyek közül legalább 2 ékezetelhagyás, 2 betűcserés és 2 betűkihagyás legyen. Az ékezetek elhagyásánál csak olyan változtatásokat végezz, amelyek értelmes magyar szóhoz vezetnek (pl. \"körte\" → \"korte\", \"tükör\" → \"tukor\", \"árvíztűrőtükörfúrógép\" → \"arvizturutukorfurogep\"). A betűcseréknél csak olyan betűpárokat cserélj fel, amelyek új, létező magyar szót alkotnak (pl. \"szék\" → \"zsek\", \"kártya\" → \"kártya\" (k-r), \"ajtó\" → \"atój\" (a-j)). A betűkihagyásnál egy-egy betűt távolíts el úgy, hogy a szó továbbra is felismerhető és érthető maradjon (pl. \"kert\" → \"krt\", \"asztal\" → \"asztal\", \"ló\" → \"lo\"). A mondat alapvető szerkezete és jelentése változatlan maradjon, a szavak legalább 75%-a pedig pontosan megegyezzen az eredeti szavakkal. A hibákat egyenletesen oszd el a mondatban, ne csak egy-egy szóra koncentrálj!", "parent_id": "depth_24", "evol_type": "in_depth", "eval_pass_rate": 0.8333333333333334, "n_eval": 6}
{"id": "depth_52", "description": "A te feladatod, hogy a kiindulási mondatokat szándékosan stilisztikailag hibás, természetellenes és nyelvtanilag helytelen formába hozd. Minden egyes mondatban két különálló hibát kell elkövetned: egy szórendi hibát és egy helyesírási hibát. A szórendi hibák közül választhatsz az alábbi kategóriák közül: a) igeidőkre jellemző szórend megsértése (pl. múlt időben a segédige és a főige helycseréje), b) melléknév és főnév helytelen elrendezése (pl. melléknév utólagos beillesztése a főnévi csoportba), c) határozók és a hozzájuk tartozó igei állapot összekapcsolatlansága (pl. helyhatározó hiánya a mondat végéről), d) névszói állítmányok szórendjének felborítása (pl. névszói állítmány túl messzire kerül a névszó utáni részektől). A helyesírási hibák közül kötelezően alkalmazz a magyar nyelv gyakori hibái közül legalább egyet az alábbi listáról: i/í, j/ly, o/ó, ö/ő, u/ú, ü/ű, s/ss, z/zz, c/cs, dz/dzs, gy/g, ty/t, valamint a hosszú-rövid magánhangzók felcserélése. Például: \"A tanár ma egy izgalmas történetet mesél el az osztálynak\" helyett \"A tanár ma el egy izgalmas történetet mesél az osztálynak\" és \"A tanár ma egy izgalmas történetet mesél el az osztalynak\".", "parent_id": "depth_21", "evol_type": "in_depth", "eval_pass_rate": 1.0, "n_eval": 6}
{"id": "depth_53", "description": "A feladatod az, hogy egy magyar mondatban szándékosan hozz létre 6-7 nyelvtani egyeztetési hibát, amelyek a szám, személy, eset vagy igeidő kategóriákba esnek. A hibáknak következetesnek kell lenniük, és ne változtassak meg alapvetően a mondat szerkezetét. A hibák legyenek nyilvánvalóak, de a mondat még érthető maradjon. Példák a hibatípusokra:", "parent_id": "depth_19", "evol_type": "in_depth", "eval_pass_rate": 0.8333333333333334, "n_eval": 6}
{"id": "depth_54", "description": "A feladatod az, hogy magyar mondatokat alakítsd át úgy, hogy szándékosan hibás szórendet és helyesírási hibákat tartalmazzanak, mégis megérthetőek maradjanak. Generálj minden mondatban 1-2 szórendi hibát és 1 helyesírási hibát. A szórendi hibákat a következőképpen alakítsd ki: - Alany-tárgy-állítmány sorrend felbontása (pl. \"Az kutya megeszi a鸿\" → \"A鸿 megeszi az kutya\") - Birtokos szerkezetek fordítva (pl. \"Az Péter háza\" → \"Péter az háza\") - Melléknév utáni főnév (pl. \"Ez egy ház szép\" → \"Ez egy szép ház\") - Főnévi igenév hibás használata (pl. \"Az olvasni szeretek könyveket\" → \"Könyveket szeretek az olvasni\") A helyesírási hibák: - Hiányzó ékezet (pl. \"kert\" → \"kert\", \"alma\" → \"alma\") - Túl sok ékezet (pl. \"kék\" → \"kéék\", \"víz\" → \"vííz\") - Rossz betűk használata (pl. \"nagy\" → \"naggy\", \"kis\" → \"kisz\") A mondatok legyenek nyilvánvalóan hibásak, de egy magyar anyanyelvű számára mégis érthetőek maradjanak.", "parent_id": "depth_9", "evol_type": "in_depth", "eval_pass_rate": 0.5, "n_eval": 6}
{"id": "depth_55", "description": "Generálj egy magyar mondatot, amely tartalmaz 2-3 szándékos ékezetelési hibát, kifejezetten a következő hibatípusok közül: ékezet elhagyása (pl. \"alma\" → \"alma\"), rossz ékezet használata (pl. \"árvíz\" → \"őrvíz\"), vagy ékezet nélküli és ékezetes betűk felcserélése (pl. \"kör\" → \"kőr\"). A hibákat olyan gyakran használt magyar szavakban ejtsd el, ahol az ékezet jelentőségteljes (pl. \"anya\" → \"nya\", \"víz\" → \"viz\", \"út\" → \"ut\"). A mondat alapvető szerkezete és jelentése maradjon változatlan, csak az ékezetekkel kapcsolatos pontatlanságok jelenjenek meg. Példa: \"Az anya meghívta a gyerekeket egy finom tea és süti közös elfogyasztására, de a gyerekek inkább vizet kértek, mert az útra készülődtek.\"", "parent_id": "depth_30", "evol_type": "in_depth", "eval_pass_rate": 0.5, "n_eval": 6}
{"id": "depth_56", "description": "A feladatod, hogy magyar mondatokat alakíts át oly módon, hogy a szórendjük természetellenes, de mégis érthető legyen. Hozz létre 1-2 szórendi hibát a következő kategóriákból:", "parent_id": "depth_39", "evol_type": "in_depth", "eval_pass_rate": 0.5, "n_eval": 6}
{"id": "breadth_57", "description": "A feladatod, hogy magyar mondatokba illeszd be szándékosan 4-5 hibásan írt idegen szót vagy kifejezést! Gyakori hibák lehetnek: helytelen nagybetűhasználat (pl. \"Google\" helyett \"google\"), helytelen ékezethasználat (pl. \"café\" helyett \"cafe\"), vagy a nyugati kiejtéshez igazodó írás (pl. \"show\" helyett \"sov\"). A mondat többi része változatlan maradjon, és a szándékosan rosszul írt szavak környezete segítse az értelmezésüket.", "parent_id": "pool", "evol_type": "in_breadth", "eval_pass_rate": 0.5, "n_eval": 6}
{"id": "depth_58", "description": "A te feladatod, hogy a megadott mondatokat szándékosan hibássá tedd úgy, hogy minden egyesben pontosan két különálló hibát kell elkövetned: egy szórendi hibát és egy helyesírási hibát. A szórendi hibák közül választhatsz az alábbi kategóriák közül: a) igeidőkre jellemző szórend megsértése (pl. jelen időben a segédige és a főngei állítmány helycseréje: \"Megyek el otthonról\" helyett \"El megyek otthonról\"), b) melléknév és főnév helytelen elrendezése (pl. melléknév előtti elhelyezés: \"A piros autót\" helyett \"Piros autót\"), c) határozók és a hozzájuk tartozó igei állapot összekapcsolatlansága (pl. időhatározó hiánya: \"Megyek iskolába\" helyett \"Megyek iskolába\"), d) névszói állítmányok szórendjének felborítása (pl. névszói állítmány túl messzire kerül: \"A könyv érdekes\" helyett \"A könyv nagyon érdekes\"). A helyesírási hibák közül kötelezően alkalmazz a magyar nyelv gyakori hibái közül legalább egyet az alábbi listáról: i/í (pl. \"viz\" helyett \"víz\"), j/ly (pl. \"jó\" helyett \"lyó\"), o/ó (pl. \"volt\" helyett \"vólt\"), ö/ő (pl. \"föld\" helyett \"feld\"), u/ú (pl. \"kur\" helyett \"kúr\"), ü/ű (pl. \"tűz\" helyett \"tuz\"), s/ss (pl. \"ásvány\" helyett \"ásszány\"), z/zz (pl. \"korzó\" helyett \"korzzó\"), c/cs (pl. \"cica\" helyett \"csica\"), dz/dzs (pl. \"dzsem", "parent_id": "depth_52", "evol_type": "in_depth", "eval_pass_rate": 0.6666666666666666, "n_eval": 6}
{"id": "depth_59", "description": "A feladatod az, hogy magyar szövegeken végezz alapos hibajavítást, amelyek főként az írásjelek (kommák, pontok, kérdőjelek, felkiáltójelek, kettőspont, pontosvessző) és kötőszavak (és, de, vagy, hanem, hiszen, mert, mivel, ugyanis, tehát, valamint stb.) használatában tartalmaznak hibákat. A szövegekben találj legalább két olyan hibát, ahol hiányzik egy kötelező vessző, vagy feleslegesen van beiktatva egy. Ezen kívül keress legalább egy helyesírási hibát is, amely lehet például elgépelt szó, rossz toldalékozás, nem megfelelő i/í, j/ly használata, vagy hibás összetétel kialakítása. Szabályok: - A \"hogy\", \"mert\", \"mivel\" jellegű mellékmondati kötőszavak előtt mindig kell vessző, kivéve ha összevonódik az igei állítmánnyal (pl. \"mennem kell\") - A felsorolásban az \"és\" előtt is kell vessző, ha több elemet sorolunk fel - A párhasználatnál (nemcsak...hanem, nemcsak...de stb.) mindkét kötőszó elé kell vessző - Példa hibás szövegrész: \"Az iskola után siettem haza mert féltem hogy elkésnek a buszok és nem akartam késni.\" Itt hiányzik a \"mert\" előtti vessző, valamint a \"hogy\" után is kellene vessző. A \"féltem\" szó után kötőjelet kellene tenni helyesen. A felsorolásban az \"és\" elé is kellene vessző.", "parent_id": "depth_10", "evol_type": "in_depth", "eval_pass_rate": 0.5, "n_eval": 6}
{"id": "depth_60", "description": "A feladatod, hogy magyar mondatokban szándékosan hozz létre 2-4 nyelvtani hibát a nyelvtani egyeztetési szabályok megsértésével. Koncentrálj a következő hibatípusokra: szám-egyeztetés (pl. \"a könyveket olvasom\" helyett \"a könyvet olvasom\"), személy-egyeztetés (pl. \"szeretek futni\" helyett \"szeret futni\"), eset-egyeztetés (pl. \"az asztal alatt\" helyett \"az asztal alá\") vagy igeidő-hiba (pl. \"mentem\" helyett \"menni\"). A hibákat úgy válaszd meg, hogy a mondat alapvető szerkezete ne változzon meg, csak a nyelvtani egyeztetés legyen hibás. Példa: \"A tanárok tanítják a diákokat matematikára\" → \"A tanárok tanít a diákokat matematikára\" (személy-egyeztetési hiba) és \"A macskák szaladnak a kertben\" → \"A macskák szaladnak a kertet\" (eset-egyeztetési hiba).", "parent_id": "seed_2", "evol_type": "in_depth", "eval_pass_rate": 0.8333333333333334, "n_eval": 6}
{"id": "depth_61", "description": "A hibatípusok: ékezetek elhagyása, betűcserék és betűkihagyások. A feladatod, hogy a megadott mondatban pontosan 6-7 ilyen hibát ejts, miközben a mondat általános szerkezete és alapvető jelentése megmarad. Az ékezetek elhagyásánál csak olyan változtatásokat végezz, amelyek érvényes, ékezet nélküli magyar szó eredményeznek (pl. \"körte\" → \"korte\", \"víz\" → \"viz\"). A betűcserék esetében csak olyan betűcserét végezz, amely után is létező magyar szó keletkezik (pl. \"karom\" → \"kram\", \"rokon\" → \"rokon\"). A betűkihagyásnál pedig olyan betűket távolíts el, hogy a szó továbbra is olvasható és érthető maradjon, miközben érvényes magyar szó legyen (pl. \"kés\" → \"ks\", \"szék\" → \"sék\"). A mondatban a szavak legalább 80%-a pontosan ugyanaz legyen, mint az eredetiben. A hibák eloszlása legyen kiegyensúlyozott: legalább 2 hiba minden hibatípusból.", "parent_id": "depth_24", "evol_type": "in_depth", "eval_pass_rate": 1.0, "n_eval": 6}
{"id": "depth_62", "description": "A feladatod, hogy a megadott mondatokban tudatosan hibákat ejts, miközben azok még érthetőek maradnak. Minden mondatban két külön hibát kell elkövetned: egy szórendi hibát és egy helyesírási hibát. A szórendi hibának a magyar nyelv alapszabályait kell megsértenie: az állítmány (ige) helytelen helyen álljon (pl. nem a mondat elején vagy végén), a melléknév fordított sorrendben álljon a főnévhez képest (pl. \"az piros virág\" helyett \"a virág piros\"), vagy a határozók helytelenül kapcsolódjanak a mondat elemeihez. A helyesírási hiba legyen az egyik gyak magyar párosítás hibája: i/í, j/ly, o/ó, ö/ő, u/ú, ü/ű, s/ss, z/zz, c/cs, dz/dzs, gy/g, ty/t. Például: \"Az autók gyorsan haladnak az úton\" helyett: \"Az autók haladnak gyorsan az úton\" és \"Az autok gyorsan haladnak az uton\".", "parent_id": "depth_21", "evol_type": "in_depth", "eval_pass_rate": 1.0, "n_eval": 6}
{"id": "depth_63", "description": "Gépelj be a mondatba 7-8 olyan hibásan írt idegen szót, amelyek magyarul elterjedten használatosak, de a magyar helyesírás szabályai szerinti helyes alakjuk gyakran elíródik. A hibás írásmódok legyenek következetesen rosszak, de a mondat még mindig érthető maradjon. Használd az alábbi szavakat vagy hozz létre hasonló típusú hibákat: \"business\", \"marketing\", \"meeting\", \"tender\", \"sourcing\", \"networking\", \"profilt\" (helyesen: profil), \"szponzor\" (helyesen: szponzor). A hibákat úgy alakítsd ki, hogy a magyar helyesírás szabályait szándékosan sértik, de a szó magyar kiejtésének vagy használatának megfelelőek maradjanak.", "parent_id": "breadth_11", "evol_type": "in_depth", "eval_pass_rate": 0.6666666666666666, "n_eval": 6}
{"id": "depth_64", "description": "A feladatod magyar mondatok hibás átalakítása úgy, hogy azok természetellenes és pongyola szórendűek maradjanak, mégis érthetőek legyenek. Minden mondatban készíts 2-3 szórendi hibát és 1-2 helyesírási hibát. A szórendi hibák lehetnek: - Alany-tárgy-állítmány sorrend felborítása (\"Az kutya megeszi a etelt\" helyett \"A kutya eszi az etelt\") - Birtokos szerkezetek felcserélése (\"Az Péter háza\" helyett \"Péter háza\") - Melléknév és főnév helyett sorrendje (\"Ez egy piros alma\" helyett \"Ez egy alma piros\") - Határozók és módosítószók rossz pozíciója (\"Ma este megyek moziba\" helyett \"Esté ma megyek moziba\") A helyesírási hibák lehetnek: - Hiányzó vagy felesleges ékezet (\"kert\" → \"kért\", \"alma\" → \"almá\") - Rossz betűk használata (\"szék\" → \"sék\", \"kő\" → \"ko\") - Szótagszerkezet megváltoztatása (\"konyha\" → \"konha\", \"csokoládé\" → \"csokoldé\") A hibákat úgy alakítsd ki, hogy a mondat még érthető maradjon, de egy magyar anyanyelvű azonnal észrevesse a hibákat. A hibák legyenek jellegzetesen teremtettek, ne véletlenek.", "parent_id": "depth_9", "evol_type": "in_depth", "eval_pass_rate": 0.6666666666666666, "n_eval": 6}
{"id": "depth_65", "description": "A feladatod két magyar nyelvű mondat létrehozása, amelyek szándékosan tartalmaznak egyedi, jól definiált helyesírási hibákat, miközben a mondatok értelmezhetősége teljes mértékben megmarad. A hibák a következő kategóriákba tartozhatnak: ékezethiány (pl. \"kert\" helyett \"kert\", ahol a hibás szónak hiányzik az ékezet), betűcserék (pl. \"nyelv\" helyett \"nyelv\", ahol a két szomszédos betű helyet cserélt), betűkiegészítések (pl. \"fa\" helyett \"fafa\", ahol egy betű ismétlődik) és betűkihagyások (pl. \"hal\" helyett \"ha\", ahol egy betű kimaradt). Minden mondatban legalább egy egyértelmű példát kell mutatnod minden hibatípusból. A mondatok legalább 70%-ának változatlanul kell maradnia, a hibák pedig természetesnek kell tűnniük, mintha véletlenül történtek volna. A hibákat úgy kell elhelyezned, hogy azok ne legyenek egymás mellett, és ne okozzanak összetévesztést, ne zavarják meg a mondat természetes folyását. A hibákat úgy válaszd ki, hogy azok ne legyenek nyilvánvalóak vagy értelmetlenségek, hanem egy tapasztalt olvasó is csak alapos áttanulmányozás után venné észre őket.", "parent_id": "depth_46", "evol_type": "in_depth", "eval_pass_rate": 0.5, "n_eval": 6}
{"id": "depth_66", "description": "A feladatod az, hogy magyar mondatokba tudatosan illeszd be tárgyesetű (-t/-et) és részes eseti (-nak/-nek) ragok hibás használatát. Fókuszálj a következőkre: - A tárgyesetű ragoknál a magánhangzók szerinti váltakozás helyett használj mindig rövid magánhangzót: \"az autót\" → \"az autót\", \"az könyvet\" → \"az könyvet\", \"az házat\" → \"az házat\". - A részes esetű ragoknál használj hibásan a -nak/-kek ragokat: \"az embernek\" → \"az embernek\", \"az kutyanak\" → \"az kutyanak\", \"az gyermeknek\" → \"az gyermeknek\". - Generálj mondatonként 6-7 ilyen hibát, és a hibás részeket jelöld szögletes zárójelekkel: [az könyvet]. - A hibáknak egyértelműeknek kell lenniük, de a mondatok természetesen hangzanak még így is.", "parent_id": "depth_8", "evol_type": "in_depth", "eval_pass_rate": 0.5, "n_eval": 6}
{"id": "breadth_67", "description": "A feladatod, hogy magyar mondatokban szándékosan hozz létre nyelvtani egyeztetési hibákat a birtokos és a birtokos személye között. Például: \"A Mari autóját festettük le, amikor az öccse kölcsönadta\" (a \"kölcsönadta\" helyett \"kölcsönadta\" lenne a helyes, mert az öccse fiatalabb, mint Mari). Hozz létre 3-4 ilyen birtokos egyeztetési hibát a mondatban, miközben a mondat értelmes marad.", "parent_id": "pool", "evol_type": "in_breadth", "eval_pass_rate": 0.5, "n_eval": 6}
